Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
aws_vpc.test-vpc-01: Refreshing state... [id=vpc-07c351726dbf60596]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_internet_gateway.test-igw-01 will be created
+ resource "aws_internet_gateway" "test-igw-01" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "test-igw-01"
        }
      + tags_all = {
          + "Name" = "test-igw-01"
        }
      + vpc_id   = "vpc-07c351726dbf60596"
    }

  # aws_subnet.test-pub-sub-01 will be created
+ resource "aws_subnet" "test-pub-sub-01" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "test-pub-sub-01"
        }
      + tags_all                                       = {
          + "Name" = "test-pub-sub-01"
        }
      + vpc_id                                         = "vpc-07c351726dbf60596"
    }

  # aws_subnet.test-pub-sub-02 will be created
+ resource "aws_subnet" "test-pub-sub-02" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "test-pub-sub-02"
        }
      + tags_all                                       = {
          + "Name" = "test-pub-sub-02"
        }
      + vpc_id                                         = "vpc-07c351726dbf60596"
    }

  # aws_vpc.test-vpc-01 will be updated in-place
~ resource "aws_vpc" "test-vpc-01" {
        id                                   = "vpc-07c351726dbf60596"
      ~ tags                                 = {
          ~ "Name" = "test-vpc-01234" -> "test-vpc-0156"
        }
      ~ tags_all                             = {
          ~ "Name" = "test-vpc-01234" -> "test-vpc-0156"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://13.228.75.65:4141/lock?id=bds-hanhvu%252Fhanhvd-aws-lab%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 3 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`